using EDIApp.Common.Constants;
using EDIApp.Socket.Implementations;

var socket = new CustomWebSocket();

await socket.StartWebsocketAsync(ExitAction.GenerateExitAction("Exit"));

//Оплата за товар по рахунку №23 від 10.09.2010 р; Платник - ТОВ "Кооператор": Рахунок - 2600123456789; Банк - Чернівецьке відділення КБ "Приватбанк"; МФО - 356032. Отримувач - ТОВ "Калинівський ринок": Рахунок - 2600987654321; Банк - ЧФ АКБ "Укрексімбанк"; МФО - 356026. Переказ: Сума - 10000; Валюта - грн.
//Поставка товару згідно з договором №45 від 25.03.2025; Платник - ТОВ "УкрТоргСервіс"; Отримувач - ТОВ "КиївМаркет"; Товар - Пральний порошок "CleanPro"; Кількість - 20; Ціна - 150.00; Одиниця виміру - кг; Сума - 3000.00;
